In [16]:
#import libraries

import pandas as pd
import numpy as np
import os
import glob
from os import listdir

import matplotlib as plt
import seaborn as sns

# set matplotlib backend to inline to view visuals in Jupyter Notebook
%matplotlib inline

In [3]:
#get the current working directory
print(os.getcwd())

/Users/badisa

In [4]:
#change the directory to where the files are

os.chdir("/Users/badisa/TWC_Datasets/")

In [59]:
def listDirs():
    """ get the list of all files and directories in the current working directory, TWC_Datasets """
    print("All files and dirs in the TWC_Datasets directory: \n", os.listdir())
listDirs()

All files and dirs in the TWC_Datasets directory:
 ['~$Ramotswa_all.xlsx', '.DS_Store', 'RIMS_boreholes_template.xlsx', 'Ramotswa_all.xlsx', '~$RIMS_boreholes_template.xlsx', 'NGA', 'RTBA_BOREHOLES']

In [44]:
# do a bash-like script or python regex for listing all files in the directories, NGA, RTBA etc 
ls -al | cd NGA/ | ls -al

SyntaxError: invalid syntax (<ipython-input-44-9a5daf4b6ecc>, line 2)

In [62]:
#define a func for listing csv files inside NGA dir

def findCSVfiles(path_to_dir, suffix = ".csv"):
    """ func for finding csv files in the NGA directory """
    path = "/Users/badisa/TWC_Datasets/NGA/NGA and WMS databases/"
    dir_list = os.listdir(path)
    return [file for file in dir_list if file.endswith(suffix)]

In [63]:
#check why this only returns one file !!!
def findCSV2(path_to_dir, suffix = ".csv"):
    """ func for"""
    path = "/Users/badisa/TWC_Datasets/NGA/NGA and WMS databases/"
    dir_list = os.listdir(path)
    for file in dir_list:
        if file.endswith(suffix):
            return file

In [61]:
findCSV2("/Users/badisa/TWC_Datasets/NGA/NGA and WMS databases/")

'A3N0513_WaterLevels.csv'

In [64]:
findCSVfiles("/Users/badisa/TWC_Datasets/NGA/NGA and WMS databases/")

['A3N0513_WaterLevels.csv',
 'A3N0521_WaterLevels.csv',
 'D4N2517_WaterLevels.csv',
 'A3N0514_WaterLevels.csv',
 'A1N0001_WaterLevels.csv',
 'Ramotswa data 2 20190904.csv',
 'A3N0015_WaterLevels.csv',
 'D4N2516_WaterLevels.csv',
 'D4N1658_WaterLevels.csv',
 'Ramotswa data 1 20190904.csv',
 'A1N0002_WaterLevels.csv',
 'D4N1468_WaterLevels.csv',
 'A3N0519_WaterLevels.csv',
 'D4N2515_WaterLevels.csv',
 'A3N0516_WaterLevels.csv',
 'Ramotswa variables inventory 20190904.csv',
 'D4N1666_WaterLevels.csv',
 'A1N0003_WaterLevels.csv']

In [27]:
#func for finding xlsx files in cwd 

def findXLSXfiles(path_to_dir, suffix = ".xlsx"):
    path = "/Users/badisa/TWC_Datasets/NGA/NGA and WMS databases/"
    dir_list = os.listdir(path)
    return [file for file in dir_list if file.endswith(suffix)]

In [28]:
findXLSXfiles("/Users/badisa/TWC_Datasets/NGA/NGA and WMS databases/")

['~$Quality Code Description.xlsx',
 'Quality Code Description.xlsx',
 'A1H001 Upper Eye Dinokana.xlsx',
 'A1H002 Lower Eye Dinokana.xlsx',
 'A1H003 Upper Eye Tweefontein.xlsx',
 'A1H004 Lower Eye Tweefontein.xlsx',
 'A1H005 Skilpad Eye.xlsx',
 '~$A1H001 Upper Eye Dinokana.xlsx',
 'Ramotswa study area plus 10km.xlsx']

In [137]:
#func that calls all the other funcs
def callfuncs():
    return findCSVfiles("/Users/badisa/TWC_Datasets/NGA/NGA and WMS databases/"), findXLSXfiles("/Users/badisa/TWC_Datasets/NGA/NGA and WMS databases/")

In [138]:
callfuncs()

(['A3N0513_WaterLevels.csv',
  'A3N0521_WaterLevels.csv',
  'D4N2517_WaterLevels.csv',
  'A3N0514_WaterLevels.csv',
  'A1N0001_WaterLevels.csv',
  'Ramotswa data 2 20190904.csv',
  'A3N0015_WaterLevels.csv',
  'D4N2516_WaterLevels.csv',
  'D4N1658_WaterLevels.csv',
  'Ramotswa data 1 20190904.csv',
  'A1N0002_WaterLevels.csv',
  'D4N1468_WaterLevels.csv',
  'A3N0519_WaterLevels.csv',
  'D4N2515_WaterLevels.csv',
  'A3N0516_WaterLevels.csv',
  'Ramotswa variables inventory 20190904.csv',
  'D4N1666_WaterLevels.csv',
  'A1N0003_WaterLevels.csv'],
 ['~$Quality Code Description.xlsx',
  'Quality Code Description.xlsx',
  'A1H001 Upper Eye Dinokana.xlsx',
  'A1H002 Lower Eye Dinokana.xlsx',
  'A1H003 Upper Eye Tweefontein.xlsx',
  'A1H004 Lower Eye Tweefontein.xlsx',
  'A1H005 Skilpad Eye.xlsx',
  '~$A1H001 Upper Eye Dinokana.xlsx',
  'Ramotswa study area plus 10km.xlsx'])

In [79]:
list1 = pd.DataFrame()

In [4]:
filenames = ['A1H001 Upper Eye Dinokana.xlsx','A1H002 Lower Eye Dinokana.xlsx']

In [81]:
for i in filenames:
    df = pd.read_excel(i, header = None, parse_dates = True)
    df ['name'] = df.iloc[0,1][0:6]
    df = df.iloc[4:, :]
    df.columns = ['date', 'mean_dis_cub', 'quality', 'name']
    list1 = list1.append(df, ignore_index = True)

In [82]:
list1.head()

                  date mean_dis_cub quality    name
0  1960-05-10 00:00:00          NaN     255  A1H001
1  1960-05-11 00:00:00        0.095      26  A1H001
2  1960-05-12 00:00:00        0.095      26  A1H001
3  1960-05-13 00:00:00        0.095      26  A1H001
4  1960-05-14 00:00:00        0.095      26  A1H001

In [11]:
#Bd add
fileList = pd.DataFrame()
filenames = ['A1H001 Upper Eye Dinokana.xlsx','A1H002 Lower Eye Dinokana.xlsx']

In [12]:
for f in filenames:
    df = pd.read_excel(f, header = None, parse_dates = True)
    df ['FileName'] = df.iloc[0,1][0:6]
    df = df.iloc[4:, :]
    df.columns = ['date', 'mean_dis_cub', 'wquality', 'name']
    fileList = fileList.append(df, ignore_index = True)
fileList.head()

                  date mean_dis_cub wquality    name
0  1960-05-10 00:00:00          NaN      255  A1H001
1  1960-05-11 00:00:00        0.095       26  A1H001
2  1960-05-12 00:00:00        0.095       26  A1H001
3  1960-05-13 00:00:00        0.095       26  A1H001
4  1960-05-14 00:00:00        0.095       26  A1H001

In [20]:
fileList.to_excel('newFileName.xlsx', index = False)

In [ ]:
#Map the quality code to description
# i.e. change the 170 to reflect period of no record

In [ ]:
ls

In [90]:
list1.to_csv('test.csv', index = False)

In [87]:
list1 ['name'] != 'A1H002'

0         True
1         True
2         True
3         True
4         True
         ...
33961    False
33962    False
33963    False
33964    False
33965    False
Name: name, Length: 33966, dtype: bool

In [75]:
list1['name'].unique()

array(['A1H001', 'A1H002', nan], dtype=object)

In [54]:
list1 ['name'].unique()

array(['A1H001', 'A1H002'], dtype=object)

In [55]:
list1 ['name'].nunique()

2

In [56]:
list1.sample(10)

                      date mean_dis_cub quality    name
63057  1981-12-07 00:00:00        0.086       1  A1H002
12956  1995-10-30 00:00:00          NaN     170  A1H001
33680  1994-07-01 00:00:00        0.016       1  A1H002
57286  1966-02-18 00:00:00        0.029       1  A1H002
8615   1983-12-11 00:00:00        0.149       1  A1H001
30332  1985-05-01 00:00:00        0.021       1  A1H002
28364  1979-12-11 00:00:00          0.1       1  A1H002
59869  1973-03-16 00:00:00        0.028       1  A1H002
7626   1981-03-27 00:00:00         0.19       1  A1H001
59367  1971-10-31 00:00:00          NaN     170  A1H002

In [57]:
list1.head()

                  date mean_dis_cub quality    name
0  1960-05-10 00:00:00          NaN     255  A1H001
1  1960-05-11 00:00:00        0.095      26  A1H001
2  1960-05-12 00:00:00        0.095      26  A1H001
3  1960-05-13 00:00:00        0.095      26  A1H001
4  1960-05-14 00:00:00        0.095      26  A1H001

In [58]:
list1.tail()

                      date mean_dis_cub quality    name
67927  1995-04-08 00:00:00        0.016       1  A1H002
67928  1995-04-09 00:00:00        0.017       1  A1H002
67929  1995-04-10 00:00:00        0.017       1  A1H002
67930  1995-04-11 00:00:00        0.017       1  A1H002
67931  1995-04-12 00:00:00        0.017       1  A1H002